IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/R5SS0_STC_R5SS0_STC.xml
<module name="R5SS0_STC_R5SS0_STC" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="R5SS0_STC_STCGCR0" acronym="R5SS0_STC_STCGCR0" offset="0x0" width="32" description="">
		<bitfield id="INTCOUNT_B16" width="16" begin="31" end="16" resetval="0x1" description="Number of intervals of the self test run (RWP - Read, Priviledge Mode Write only)Count of intervals that need to be covered for a specific selftest run.The selftest controller sends out ?complete? indication once it runs all of the intervals programmed in this field.INTCOUNT_B16=0 is an invalid configuration for a selftest." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="NU0" width="5" begin="15" end="11" resetval="0x0" description="Reserved bits" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="CAP_IDLE_CYCLE" width="3" begin="10" end="8" resetval="0x1" description="Idle cycles before and after capture clock (RWP - Read, Priviledge Mode Write only)Idle Cycles before and after capture clock. This value is used to insert that many idle cycles in the Capture phase. Programmable idle cycles allow implementation flexibility on SCAN_EN signal at chip level based on the size of the UUT and timing requirements." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="SCANEN_HIGH_CAP_IDLE_CYCLE" width="3" begin="7" end="5" resetval="0x1" description="Idle cycles before and after capture clock (RWP - Read, Priviledge Mode Write only). *NOT BYTE ACCESSIBLEIdle Cycles between scan_en going high to func_clk_en generation and scan_en going high to misr_log_en generation. This value is used to insert that many idle cycles in the shift clock (scan_en going high to func_clk_en generation) and misr_log_clk (scan_en going high to misr_log_en generation) generation. Programmable idle cycles allow implementation flexibility on SCAN_EN signal at chip level based on the size of the UUT and timing requirements." range="7 - 5" rwaccess="RW"/> 
		<bitfield id="NU1" width="3" begin="4" end="2" resetval="0x0" description="Reserved bits" range="4 - 2" rwaccess="RO"/> 
		<bitfield id="RS_CNT_B1" width="2" begin="1" end="0" resetval="0x0" description="Restart/Continue or preload (RWP - Read, Priviledge Mode Write only)This bit specifies the selftest controller whether to continue the run from next interval onwards, restart from ROM address 0 or preload from a prescribed interval. This bit gets reset after the completion of selftest run.00 = Continue NSTC run from previous interval01 = Restart NSTC run from ROM address 01X = Start from segment number specified in STC_SEGPLR register" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_STCGCR1" acronym="R5SS0_STC_STCGCR1" offset="0x4" width="32" description="">
		<bitfield id="NU2" width="20" begin="31" end="12" resetval="0x0" description="Reserved bits" range="31 - 12" rwaccess="RO"/> 
		<bitfield id="SEG0_CORE_SEL" width="4" begin="11" end="8" resetval="0x0" description="Selects the Segment0 CORE for self test (RWP - Read, Priviledge Mode Write only)Select the Segment0 CORE for Self -Test0001 = Select CORE for selftestOther = CORE not selected." range="11 - 8" rwaccess="RW"/> 
		<bitfield id="NU3" width="1" begin="7" end="7" resetval="0x0" description="Reserved bits" range="7" rwaccess="RO"/> 
		<bitfield id="CODEC_SPREAD_MODE" width="1" begin="6" end="6" resetval="0x0" description="Codec Spread Mode control signal (RWP - Read, Priviledge Mode Write only)This bit is used to configure the codec in spread / X-OR mode.1 = Spread mode0 = XOR mode" range="6" rwaccess="RW"/> 
		<bitfield id="LP_SCAN_MODE" width="1" begin="5" end="5" resetval="0x1" description="LP scan mode (RWP - Read, Priviledge Mode Write only)This bit is used to decide the scan configuration:1 = Operates in Low Power Scan Mode. 0 = Operates in Normal Scan Mode." range="5" rwaccess="RW"/> 
		<bitfield id="ROM_ACCESS_INV" width="1" begin="4" end="4" resetval="0x0" description="Rom access inversion mode (RWP - Read, Priviledge Mode Write only)- NOT SUPPORTED" range="4" rwaccess="RW"/> 
		<bitfield id="ST_ENA_B4" width="4" begin="3" end="0" resetval="0x5" description="Self test enable key (RWP - Read, Priviledge Mode Write only)1010 = Self test run enabled All values other than 1010 = Self test run disabled" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_STCTPR" acronym="R5SS0_STC_STCTPR" offset="0x8" width="32" description="">
		<bitfield id="TO_PRELOAD" width="32" begin="31" end="0" resetval="0x4294967295" description="Self test time out preload (RWP - Read, Priviledge Mode Write only)This register contains the total number of STC clock cycles it will take before a self-test timeout error will be triggered after the initiation of the self-test run. This is a fail safe feature to avoid system hang-up situation on account of any run away self test issues. This register should be loaded with a meaningful count value for this feature to be effective.This register value (preload count value) gets loaded into the self test timeout down counter whenever a self test run is initiated (ST_ENA is enabled). and gets disabled on completion of a self test run." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_STC_CADDR" acronym="R5SS0_STC_STC_CADDR" offset="0xC" width="32" description="">
		<bitfield id="ADDR" width="32" begin="31" end="0" resetval="0x0" description="Current ROM Address for CORE1This register reflects the current ROM address (for micro code load) accessed during selftest for CORE1 in of case segment0 and all the remaining segmentsn  where n = 1 to 3)." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_STCCICR" acronym="R5SS0_STC_STCCICR" offset="0x10" width="32" description="">
		<bitfield id="CORE2_ICOUNT" width="16" begin="31" end="16" resetval="0x0" description="Specifies the last interval number for CORE2This specifies the Last executed Interval number for CORE2 of Segment0 if self test is being executed for secondary core as well. This field is applicable only for Segment 0." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CORE1_ICOUNT" width="16" begin="15" end="0" resetval="0x0" description="Specifies the last interval number for CORE1This specifies the Last executed Interval number of a self-test run." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_STCGSTAT" acronym="R5SS0_STC_STCGSTAT" offset="0x14" width="32" description="">
		<bitfield id="NU4" width="20" begin="31" end="12" resetval="0x0" description="Reserved bits" range="31 - 12" rwaccess="RO"/> 
		<bitfield id="ST_ACTIVE" width="4" begin="11" end="8" resetval="0x5" description="Tells whether self test is currently active or not.1010   = Self test is activeOthers   = SelfTest is not activeOnce the self-test completes and ST_ENA_B4 key is cleared, this field will reflect the inactive value." range="11 - 8" rwaccess="RO"/> 
		<bitfield id="NU5" width="6" begin="7" end="2" resetval="0x0" description="Reserved bits" range="7 - 2" rwaccess="RO"/> 
		<bitfield id="TEST_FAIL" width="1" begin="1" end="1" resetval="0x0" description="Test_fail flag (RCP - Read, Clear on Writing in Priviledge Mode)0   = Self test run has not failed1   = SelfTest run has failed. Write Clear." range="1" rwaccess="RO"/> 
		<bitfield id="TEST_DONE" width="1" begin="0" end="0" resetval="0x0" description="Test_done_flag (RCP - Read, Clear on Writing in Priviledge Mode)0   = Not completed1   = SelfTest run Completed" range="0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_STCFSTAT" acronym="R5SS0_STC_STCFSTAT" offset="0x18" width="32" description="">
		<bitfield id="NU6" width="27" begin="31" end="5" resetval="0x0" description="Reserved bits" range="31 - 5" rwaccess="RO"/> 
		<bitfield id="FSEG_ID" width="2" begin="4" end="3" resetval="0x0" description="Failed Segment ID (RCP - Read, Clear on Writing in Priviledge Mode)This field captures the Segment number for which any of the failures like TO_ER_B1, CPU1_FAIL_B1 and CPU2_FAIL_B1 occur.00   = Failure on Segment 001   = Failure on Segment 110   = Failure on Segment 211   = Failure on Segment 3" range="4 - 3" rwaccess="RO"/> 
		<bitfield id="TO_ER_B1" width="1" begin="2" end="2" resetval="0x0" description="Tells whether self test failed because of time out error (RCP - Read, Clear on Writing in Priviledge Mode)0   = No time out error occurred1   = SelfTest run failed due to a timeout error" range="2" rwaccess="RO"/> 
		<bitfield id="CPU2_FAIL_B1" width="1" begin="1" end="1" resetval="0x0" description="Tells whether MISR mismatch happenned in CORE2 when in Segment0 mode (RCP - Read, Clear on Writing in Priviledge Mode)0   = No MISR mismatch for CORE21   = Self test run failed due to MISR mismatch for CORE2" range="1" rwaccess="RO"/> 
		<bitfield id="CPU1_FAIL_B1" width="1" begin="0" end="0" resetval="0x0" description="Tells whether MISR mismatch happenned in CORE1 (RCP - Read, Clear on Writing in Priviledge Mode)Applicable to all segments.0   = No MISR mismatch for CORE11   = Self test run failed due to MISR mismatch for CORE1" range="0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_STCSCSCR" acronym="R5SS0_STC_STCSCSCR" offset="0x1C" width="32" description="">
		<bitfield id="NU7" width="27" begin="31" end="5" resetval="0x0" description="Reserved bits" range="31 - 5" rwaccess="RO"/> 
		<bitfield id="FAULT_INS_B1" width="1" begin="4" end="4" resetval="0x0" description="Fault Insertion bit (RWP - Read, Priviledge Mode Write only)0   =  No fault insertion.1   =  Inserts fault in the logic unedr test which will make signature compare fail. This feature is used as diagnostic check of the STC IP." range="4" rwaccess="RW"/> 
		<bitfield id="SELF_CHECK_KEY_B4" width="4" begin="3" end="0" resetval="0x5" description="Signature compare logic self check key enable/disable (RWP - Read, Priviledge Mode Write only)1010   = Signature compare logic Self Check is enabledAll values other than 1010   = Signature compare logic Self Check is disabled" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_STC_CADDR2" acronym="R5SS0_STC_STC_CADDR2" offset="0x20" width="32" description="">
		<bitfield id="ADDR" width="32" begin="31" end="0" resetval="0x0" description="Current ROM Address for CORE2This register reflects the current ROM address(for micro code load) accessed during selftest for CORE2 in of case segment0." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_STC_CLKDIV" acronym="R5SS0_STC_STC_CLKDIV" offset="0x24" width="32" description="">
		<bitfield id="NU8" width="5" begin="31" end="27" resetval="0x0" description="Reserved bits" range="31 - 27" rwaccess="RO"/> 
		<bitfield id="CLKDIV0" width="3" begin="26" end="24" resetval="0x0" description="Clock division for Seg0 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 0" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="NU9" width="5" begin="23" end="19" resetval="0x0" description="Reserved bits" range="23 - 19" rwaccess="RO"/> 
		<bitfield id="CLKDIV1" width="3" begin="18" end="16" resetval="0x0" description="Clock division for Seg1 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 1" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="NU10" width="5" begin="15" end="11" resetval="0x0" description="Reserved bits" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="CLKDIV2" width="3" begin="10" end="8" resetval="0x0" description="Clock division for Seg2 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 2" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="NU11" width="5" begin="7" end="3" resetval="0x0" description="Reserved bits" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="CLKDIV3" width="3" begin="2" end="0" resetval="0x0" description="Clock division for Seg3 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 3" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_STC_SEGPLR" acronym="R5SS0_STC_STC_SEGPLR" offset="0x28" width="32" description="">
		<bitfield id="NU12" width="30" begin="31" end="2" resetval="0x0" description="Reserved bits" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="SEGID_PLOAD" width="2" begin="1" end="0" resetval="0x0" description="Segment number for which preload is to be started (RWP - Read, Priviledge Mode Write only)This specifies the segment for which the address of its First interval will be pre-loaded into the NSTC ROM address counter. The 1st address of each segment are defined in SEGx_START_ADDR register.The address of the 1st interval of the selected segment is loaded into the NSTC ROM address counter when the RS_CNT_B1 bits of STC_GCR0 are set to 1X00   =  Preload the address of the 1st interval of segment 0.01   =  Preload the address of the 1st interval of segment 1.10   =  Preload the address of the 1st interval of segment 2.11   =  Preload the address of the 1st interval of segment 3." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_SEG0_START_ADDR" acronym="R5SS0_STC_SEG0_START_ADDR" offset="0x2C" width="32" description="">
		<bitfield id="NU13" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 0 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_SEG1_START_ADDR" acronym="R5SS0_STC_SEG1_START_ADDR" offset="0x30" width="32" description="">
		<bitfield id="NU14" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 1 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR.This register is present only when RTL parameter NUM_SEG = 1." range="19 - 0" rwaccess="RW"/>
	</register>
