IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/R5SS0_STC_R5SS0_STC.xml
	<register id="R5SS0_STC_SEG2_START_ADDR" acronym="R5SS0_STC_SEG2_START_ADDR" offset="0x34" width="32" description="">
		<bitfield id="NU15" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 2 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR.This register is present only when RTL parameter NUM_SEG = 2." range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_SEG3_START_ADDR" acronym="R5SS0_STC_SEG3_START_ADDR" offset="0x38" width="32" description="">
		<bitfield id="NU16" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 3 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR.This register is present only when RTL parameter NUM_SEG = 3." range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_0" acronym="R5SS0_STC_CORE1_CURMISR_0" offset="0x3C" width="32" description="">
		<bitfield id="C1MISR0" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_1" acronym="R5SS0_STC_CORE1_CURMISR_1" offset="0x40" width="32" description="">
		<bitfield id="C1MISR1" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_2" acronym="R5SS0_STC_CORE1_CURMISR_2" offset="0x44" width="32" description="">
		<bitfield id="C1MISR2" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_3" acronym="R5SS0_STC_CORE1_CURMISR_3" offset="0x48" width="32" description="">
		<bitfield id="C1MISR3" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_4" acronym="R5SS0_STC_CORE1_CURMISR_4" offset="0x4C" width="32" description="">
		<bitfield id="C1MISR4" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_5" acronym="R5SS0_STC_CORE1_CURMISR_5" offset="0x50" width="32" description="">
		<bitfield id="C1MISR5" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_6" acronym="R5SS0_STC_CORE1_CURMISR_6" offset="0x54" width="32" description="">
		<bitfield id="C1MISR6" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_7" acronym="R5SS0_STC_CORE1_CURMISR_7" offset="0x58" width="32" description="">
		<bitfield id="C1MISR7" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_8" acronym="R5SS0_STC_CORE1_CURMISR_8" offset="0x5C" width="32" description="">
		<bitfield id="C1MISR8" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_9" acronym="R5SS0_STC_CORE1_CURMISR_9" offset="0x60" width="32" description="">
		<bitfield id="C1MISR9" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_10" acronym="R5SS0_STC_CORE1_CURMISR_10" offset="0x64" width="32" description="">
		<bitfield id="C1MISR10" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_11" acronym="R5SS0_STC_CORE1_CURMISR_11" offset="0x68" width="32" description="">
		<bitfield id="C1MISR11" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_12" acronym="R5SS0_STC_CORE1_CURMISR_12" offset="0x6C" width="32" description="">
		<bitfield id="C1MISR12" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
