IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/R5SS0_STC_R5SS0_STC.xml
	<register id="R5SS0_STC_CORE1_CURMISR_23" acronym="R5SS0_STC_CORE1_CURMISR_23" offset="0x98" width="32" description="">
		<bitfield id="C1MISR23" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_24" acronym="R5SS0_STC_CORE1_CURMISR_24" offset="0x9C" width="32" description="">
		<bitfield id="C1MISR24" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_25" acronym="R5SS0_STC_CORE1_CURMISR_25" offset="0xA0" width="32" description="">
		<bitfield id="C1MISR25" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_26" acronym="R5SS0_STC_CORE1_CURMISR_26" offset="0xA4" width="32" description="">
		<bitfield id="C1MISR26" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE1_CURMISR_27" acronym="R5SS0_STC_CORE1_CURMISR_27" offset="0xA8" width="32" description="">
		<bitfield id="C1MISR27" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE1This register contains the MISR data of the current interval for CORE1 in the case of segment0 and the remaining Segments 1 to 3. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_0" acronym="R5SS0_STC_CORE2_CURMISR_0" offset="0xAC" width="32" description="">
		<bitfield id="C2MISR0" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_1" acronym="R5SS0_STC_CORE2_CURMISR_1" offset="0xB0" width="32" description="">
		<bitfield id="C2MISR1" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_2" acronym="R5SS0_STC_CORE2_CURMISR_2" offset="0xB4" width="32" description="">
		<bitfield id="C2MISR2" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_3" acronym="R5SS0_STC_CORE2_CURMISR_3" offset="0xB8" width="32" description="">
		<bitfield id="C2MISR3" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_4" acronym="R5SS0_STC_CORE2_CURMISR_4" offset="0xBC" width="32" description="">
		<bitfield id="C2MISR4" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_5" acronym="R5SS0_STC_CORE2_CURMISR_5" offset="0xC0" width="32" description="">
		<bitfield id="C2MISR5" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_6" acronym="R5SS0_STC_CORE2_CURMISR_6" offset="0xC4" width="32" description="">
		<bitfield id="C2MISR6" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_7" acronym="R5SS0_STC_CORE2_CURMISR_7" offset="0xC8" width="32" description="">
		<bitfield id="C2MISR7" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_8" acronym="R5SS0_STC_CORE2_CURMISR_8" offset="0xCC" width="32" description="">
		<bitfield id="C2MISR8" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_9" acronym="R5SS0_STC_CORE2_CURMISR_9" offset="0xD0" width="32" description="">
		<bitfield id="C2MISR9" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_STC_CORE2_CURMISR_10" acronym="R5SS0_STC_CORE2_CURMISR_10" offset="0xD4" width="32" description="">
		<bitfield id="C2MISR10" width="32" begin="31" end="0" resetval="0x0" description="MISR Signature for CORE2This register contains the MISR data from the CORE2 for the current interval. This is applicable to Segment 0 alone. This value will be compared with the GOLDEN MISR value copied from ROM. This register gets reset to its default value with Power on or system reset assertion. The MISR values should be read only after the Self Test is completed." range="31 - 0" rwaccess="RO"/>
	</register>
